Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: If not specified, it will be computed from |size| and |overlap| (A; default: |21 29.7 20 28.7 0.5 0.5 cm|) * |page-numbers <on/off>| = turn on/off page numbering (A; default: |true|) * |exclude-pages <on/off> <list>| = exclude specified pages from cave atlas.
ru_ru: Если не указано, то размеры будут вычислены из |size| и |overlap| (A; по умолчанию: |21 29,7 20 28,7 0,5 0,5 см|). * |page-numbers <on/off>| = включить/выключить нумерацию страниц (A; по умолчанию: |on|). * |exclude-pages <on/off> <список>| = исключить указанные страницы из\break атласа.

source: If not specified, it's oriented to north.
ru_ru: Если не указано, то ориентировано на север.

source: If not specified, it's perpendicular to the line on its left side.
ru_ru: Если не\break указано, она перпендикулярна линии с левой стороны.

source: If passages are more or less vertical (|inclination > vthreshold|), even UD becomes perpendicular to the shot -- otherwise passages would not look very good.
ru_ru: Если ходы более или менее вертикальные (|наклон > vthreshold|), тогда даже UD становится перпендикулярным к замеру, в противном случае ходы выглядят не очень хорошо.

source: If passeges are horizontal (|inclination < vthreshold|), LR is perpendicular to the shot and UD is vertical.
ru_ru: Если ходы горизонтальны (|наклон < vthreshold|), LR считается\break перпендикулярным к замеру, а UD вертикальными.

source: If scrap projection is none, this is the only transformation that is done with coordinates.
ru_ru: Если проекция скрапа установлена в none, то это единственное преобразование, которое выполняется с координатами.

source: If set on (by default) all subsurveys of the given survey are recursively selected/unselected.
ru_ru: По умолчанию установлен в |on|, все подсъемки данной съемки рекурсивно выбираются/не выбираются.

source: If set to |all|, all symbols from the current symbol set are displayed.
ru_ru: Если установлено значение |all|, то отображаются все символы из текущего набора символов.

source: If set |auto|, passage is generated only if there is no scrap referencing given centreline.
ru_ru: Если установлен |auto|, то ход генерируется только в том случае, если отсутствует скрап содержащий данную нитку хода.

source: If survey contains survey data, but it has no main entrance specified, it is not considered as a cave, just as data organization unit and thus not present in the cave list.
ru_ru: Если съемка содержит данные, но не указан главный входа, то съемка не считается пещерой, как единица организации данных и, таким образом, не присутствует в списке пещер.

source: If the PDF file is used directly, you have to set DPI and output format before automatic conversion|ghostscript| and |convert| should be installed on your system.
ru_ru: Если используется непосредственно файл PDF, то вам необходимо\break установить DPI и формат вывода перед автоматическим преобразованием |Ghostscript| и |convert| должны быть установлены в вашей системе.

source: If the altitude value is prefixed by ``|fix|'' (e.g. |-value [fix 1300]|), this value is used as an absolute altitude.
ru_ru: Если значение\break altitude (высотная отметка) имеет префикс ``|fix|'' (например |-value [fix 1300]|), то это значение используется как абсолютная высота.

source: If the cave is larger than a few meters it's a good idea to split data in more files and separate centreline data from map data.
ru_ru: Если пещера больше нескольких метров, неплохо было бы разделить данные в большем количестве файлов и отделить данные нитки хода от данных карты.

source: If the coordinates of survey stations are changed in the process of loop closure, then all relevant data is moved correspondingly, so the map is always up-to-date.
ru_ru: Если\break координаты станций съемки изменяются в процессе закрытия колец, то все связанные данные перемещаются соответственно, поэтому карта\break всегда актуальна.

source: If the format doesn't support arbitrary passage shape definition, only the centreline is included.
ru_ru: Если формат не поддерживает отображение формы хода, то отображается только нитка хода.

source: If the line is closed, it is filled with the background colour.], |rock-edge|Inner edges of large boulders.], |water-flow|;
ru_ru: Если линия замкнута, она заполняется цветом фона.], |rock-edge| (внутренняя кромка\break глыбы)Внутренние края больших валунов.], |water-flow| (водоток);

source: If the map in PDF format has been converted to raster using external program, convertor uses raster image { and} pdf map with the same base name located in the same directory to calculate the calibration data.
ru_ru: Если карта в формате PDF была преобразована в растровое\break изображение с использованием внешней программы, конвертер использует растровое изображение { и} pdf-карту с тем же базовым именем,\break расположенным в том же каталоге, для вычисления калибровочных данных.

source: If the output filename is given and no output format is specified, the format is determined from the filename extension.
ru_ru: Если задано имя выходного файла и не указан выходной формат, формат определяется из расширения имени файла.

source: If the scrap doesn't contain at least two survey stations with the |-name| reference, you have to use the |-scale| option for calibrating the scrap.
ru_ru: Если скрап не содержит по крайней мере две станции съемки с определением |-name|, тогда Вы должны использовать опцию |-scale| для калибровки скрапа

source: If the situation is more complicated, e.g. there is { m3} below { m2}
ru_ru: Если ситуация более сложная, например, существует { m3} ниже { m2}

source: If the symbol has a subtype, |<symbol-type>| argument may have one of the following forms: |type:subtype| or simply |type|, which assigns new symbol set to all subtypes of a given symbol.
ru_ru: Если символ имеет подтип, аргумент |<тип символа>| может иметь одну из следующих форм: |тип:подтип| или просто |тип|, который присваивает новый набор символов всем подтипам данного символа.

source: If the value is 0 it doesn't display anything.
ru_ru: Если значение равно 0, тогда ничего не отображается.

source: If the value is specified, it gives the altitude difference of the point on the wall relative to the nearest station.
ru_ru: Если значение указано, оно дает разность высот точки на стене относительно ближайшей станции.

source: If the |main_map| is located in the |main| survey, scrap |s1| may cover part of the centreline from survey |a|, complete survey |b| and part of |c|; |s2| will cover part of the |a| and |c| surveys and a complete |d| survey.
ru_ru: Если |main_map| находится в survey |main|, скрап |s1| может содержать часть нитки хода из survey |a|, полную нитку хода |b| и часть |c|; |s2| будет содержать часть |a| и |c| и полную нитку |d|.

source: If there are no scraps or maps in the data, centreline from all surveys is exported in the map.
ru_ru: Если в данных нет скрапов или карт, то на карте будет отображаться нитка хода из всех съемок.

source: If there are no scraps with the specified projection then Therion will display centreline from selected surveys.
ru_ru: Если нет скрапов с указанной проекцией, Therion отобразит нитку хода из выбранных съемок.

source: If there are no such pages, the value is set to |notdef|.
ru_ru: Если таких страниц нет, то значение устанавливается в |notdef|.

source: If there is a passage, that was explored, but not surveyed yet, estimated explored length of this passage can be added to the station with |continuation| flag.
ru_ru: Если есть ход, который был исследован, но еще не снят, то предполагаемая исследуемая длина этого хода может быть учтена добавлением к станции флага |continuation|.

source: If there is no gradient specification, behaviour is symbol-set dependent (e.g. no tick in UIS, tick in the middle in SKBB).
ru_ru: Если спецификация градиента отсутствует, то\break поведение зависит от набора символов (например, без галочки в UIS,\break галочка посередине в SKBB).

source: If there is no map defined, all scraps in the given projection are exported.
ru_ru: Если карта не определена, экспортируются все скрапы в данной проекции.

source: If there is no map selected, all scraps belonging to selected surveys are selected by default for map export.
ru_ru: Если карта не выбрана, то выбираются все скрапы принадлежащие выбранным съемкам.

source: If there is no orientation specification, gradient marks are perpendicular to the slope line.], |floor-step|, |pit|, |ceiling-step|, |chimney|, |overhang|, |ceiling-meander|, |floor-meander|;
ru_ru: Если ориентация отсутствует, то градиентные метки перпендикулярны линии наклона.], |floor-step| (уступ пола), |pit| (колодец), |ceiling-step| (уступ потолка), |chimney| (камин), |overhang| (нависание потолка), |ceiling-meander| (меандр, канал в потолке), |floor-meander| (меандр, канал в полу);

source: If there is no station list, all subsequent stations are marked.
ru_ru: Если список станций отсутствует, все последующие станции будут отмечены\break соответствующим типом.

source: If there is no such a page its page number is set to 0.
ru_ru: Если такой страницы нет, номер ее страницы равен 0.

source: If there is no such symbol or symbol set you want, it's possible to design new map symbols.
ru_ru: Если такой символ или набор символов вам не нужен, можно создать новые символы карты.

source: If there is no |thconfig| file (e.g. current directory is not a data directory), Therion exits with an error message.
ru_ru: Если не существует файла |thconfig| (например, текущий каталог не является каталогом\break данных), тогда Therion выдаст сообщение об ошибке.

source: If there is some explored passage behind this entrance, but you did not survey it properly, you should add also |continuation| flag and |explored| flag followed by explored length.
ru_ru: Если за этим входом есть какой-то разведанный проход, но вы не\break обследовали его должным образом, вы должны добавить также флаги\break |continuation| (продолжение) и |explored| (исследование), за которым следует исследуемая длина.

source: If therion does not offer any appropriate symbol for the feature you want to draw to the map, you can use user defined symbol type (type |u|, valid for point, line and area objects).
ru_ru: Если Therion не содержит подходящий символ для ваших функции, вы можете нарисовать свой символ на карте, используя определенный тип символа (тип |u|, применяется для объектов точки, линии и области).

source: If this match is found, stations are inserted into survey found.
ru_ru: Если это совпадение найдено, то станции вставляются в найденную съемку.

source: If two stations are given---direction is applied only to given shot.
ru_ru: Если заданы две станции -- направление применяется только к данному замеру;

source: If we would like to extend branch starting with station 5 to the left, we need to specify also
ru_ru: Если мы хотим развернуть нитку начиная со станции 5 влево, нам нужно указать также

source: If we would like to start this branch from station 4, we need to forbid therion to extend station 5 from 1.
ru_ru: Если мы хотим начать эту нитку со станции 4, нам необходимо запретить Therion'у разворот станции 5 из станции 1.

source: If you can not see these points, you can either
ru_ru: Если вы не видите их, вы можете:

source: If you do not specify any |cs| in your dataset, it is assumed you are working in |local| coordinate system, and no conversions are done.
ru_ru: Если вы не указали какой-либо |cs| в вашем наборе данных, то\break предполагается, что вы работаете в |local| системе координат, и никакие преобразования не выполняются.

source: If you draw some scraps with |none| projection, it's necessary to { calibrate} the drawing area.
ru_ru: Если вы нарисуете несколько скрапов с |none| проекцией, необходимо\break { откалибровать} область рисования.

source: If you have just surveyed entrance station (e.g. using GPS or standard surveying methods), all you need to do is to assign |entrance| flag using
ru_ru: Если у вас есть станция на входе с известными координатами (например, используя GPS или стандартные методы съемки), все, что вам нужно сделать, это назначить флаг |entrance| (вход)

source: If you have properly surveyed some cave, its data are usually in some |survey| structure.
ru_ru: Если вы как следует отсняли какую-то пещеру, ее данные обычно находятся в некоторых |survey|.

source: If you import your .3d file using
ru_ru: Если вы импортируете файл .3d, используя

source: If you save data file as `test.th' and configuration file as `thconfig' you may process them with Therion.
ru_ru: Если вы сохраните файл данных как `test.th' и конфигурационный файл как `thconfig', вы можете обработать их с помощью Therion'а.

source: If you specify |cs| anywhere in the data, you have to specify it for all location data (|fix|, |origin| in |layout| etc.).
ru_ru: Если вы укажете |cs| в любом месте данных, то вы должны указать его для всех данных местоположения (|fix|, |origin| и\break |layout| и т.д.).

source: If you want to add some unsupported encodings, read the chapter { Compilation / Hacker's guide}.
ru_ru: Если вы хотите добавить некоторые не поддерживаемые кодировки,\break прочитайте главу { Компиляция / Руководство хакера};

source: If you want to change an SD, use the sd option after this command.
ru_ru: Если вы хотите\break изменить SD, используйте опцию sd после этой команды.

source: If you want to combine them, you must use them in one grade line.
ru_ru: Если вы хотите их комбинировать, вы должны использовать их в одной строке.

source: If you want to compile Therion from source code and run it, you need (first three are required only during compilation):
ru_ru: Если вы хотите скомпилировать Therion из исходников и запустить его, вам нужны (первые три необходимы только во время компиляции):

source: If you want to continue compilation without break, use |<command>
ru_ru: Если вы хотите продолжить\break компиляцию без ожидания, используйте команду |<command>

source: If you want to explicitly set the declination for undated survey data, use `|-|' instead of date.
ru_ru: Если вы хотите явно указать склонение для данных без даты, используйте `|-|' вместо даты.

source: If you want to list them, use |--print-init-file| option.
ru_ru: Если вы хотите их вывести, используйте опцию |--print-init-file|.

source: If you want to put a double-quote |"| into text in |" "| you need to insert it twice.
ru_ru: Если вы хотите поместить двойную кавычку |"| в текст в |" "| вам нужно вставить его дважды.

source: If you want to use own fonts for latin or non-latin characters in PDF maps, edit initialization file.
ru_ru: Если вы хотите использовать собственные шрифты для латинских или не латинских символов в PDF-картах, отредактируйте файл инициализации.

source: If you will import .3d file with |-surveys use| switch, then therion tries to find the match between { survex prefix} and { therion survey name}.
ru_ru: Если вы импортируете файл .3d с |-surveys use|, то Therion пытается найти совпадение между {префиксом survex} и { названием съемки Therion'а}.

source: If you're lazy try
ru_ru: Если вы ленитесь, попробуйте:

source: If your joining code will be
ru_ru: Если ваш код присоединения будет

source: If |""| is specified as a comment, it is ignored.
ru_ru: Если в качестве комментария указан |""|, то он\break игнорируется.

source: If |on|, labels are coloured using the colour of associated scrap.
ru_ru: Если |on|, то подписи окрашиваются с использованием цвета связанного скрапа.

source: If |scrap-names| is specified, scrap names are shown for each scrap, |station-names| displays name of each survey station.
ru_ru: Если |scrap-names| указано, имена скрапов отображаются для каждого\break скрапа, |station-names| отображает имя каждой станции съемки.

source: If |title-pages| option in |layout| is on, each chapter starts with a title page.
ru_ru: Если опция |title-pages| в |layout| включена, то каждая глава начинается с титульной страницы.

source: Ignored if there is no |<br>| tag.
ru_ru: Игнорируется, если нет тега |<br>|;

source: Image after morphing:
ru_ru: Изображение после морфинга:

source: Importing sketch does not create scrap data directly.
ru_ru: Импорт эскиза напрямую не создает данные скрапа.

source: In 1999 we begun to think about creating own program for map drawing.
ru_ru: В 1999 году мы начали думать о создании собственной программы для\break рисования карт.

source: In 2002 we were able to introduce the first really usable version of Therion, which met our requirements.
ru_ru: В 2002 году мы представили первую версию Therion'а, которая отвечала нашим требованиям.

source: In addition to map pages contains atlas additional items: title page, basic facts about the cave, legend with used map symbols etc.
ru_ru: В дополнение к страницам карты атлас содержит дополнительные области: титульная страница, основные факты о пещере, легенда с использованием символов карты и т.д.

source: In atlas mode some additional information is put on each page: page number, map name, and page label.
ru_ru: В режиме атласа на каждую страницу помещается дополнительная\break информация: номер страницы, название карты и метка страницы.

source: In complicated systems, a scrap is usually one chamber or one passage.
ru_ru: В сложных системах скрап обычно представляет собой один грот или один ход.

source: In map mode applies iff |page-grid| is |on| (M, A; default: |18 22.2 cm|) * |overlap <value> <units>| = set overlap size in paper units in the atlas mode or map margin in the map mode (M, A; default: |1 cm|) * |page-setup <dimensions> <units>| = set page dimensions in this order: paper-width, paper-height, page-width, page-height, left-margin and top-margin.
ru_ru: Применяется в режиме карты, если |page-grid| установлен в |on| (M, A; по умолчанию: |18 22,2 см|). * |overlap <значение> <единицы>| = установить размер перекрытия в\break единицах в режиме атласа или поля карты в режиме карты (M, A; по умолчанию: |1 см|). * |page-setup <размеры> <единицы>| = установить размеры страницы в таком порядке: ширина бумаги, высота бумаги, ширина страницы, высота\break страницы, левое поле и верхнее поле.

source: In multilingual strings only the text between |<lang:XX>| (where |XX| is the language selected in initialization or configuration file) and the next |<lang:YY>| tag is displayed on the output.
ru_ru: В многоязычных строках только текст между |<lang:XX>| (где |XX| -- это язык, выбранный в файле инициализации или конфигурации) и следующим тегом |<lang:YY>| отображается на выходе.

source: In order to be sure that lines intersect even after scrap transformation you may e.g. continue a lake border 1 cm behind a passage wall---these overlaps will be automatically clipped by scrap border.
ru_ru: Чтобы\break убедиться, что линии пересекаются даже после преобразования скрапа, вы можете продолжить границу на 1 см за стену хода -- эти выступы будут автоматически обрезаны по границе скрапа.

source: In order to place them somewhere on the map page, you have to define || macro in the |code tex-map| section of the |layout| command.
ru_ru: Чтобы разместить их где-нибудь на странице карты, вам нужно определить макрос || в разделе |code tex-map| команды |layout|.

source: In such a case we create one special file called |INDEX.th| which includes all other |*.th| files from given directory and contains |equate| commands to define connections between surveys.
ru_ru: В этом случае мы создаем один специальный файл с именем |INDEX.th| который включает все остальные |*.th| файлы из данного каталога и содержит команды |equate| для определения связей между\break съемками.

source: In that case it's possible to add support for any 8-bit encoding for text input files.
ru_ru: В этом случае можно добавить поддержку любой 8-битной кодировки для текстовых входных файлов.

source: In the 1990s we've done a lot of caving and cave surveying.
ru_ru: В 1990-е мы активно занимались спелеологией и созданием карт.

source: In the case of vertical shots, UD is interpreted as north-south dimension from the station to allow tube-like modelling of verticals.
ru_ru: В случае вертикальных замеров UD интерпретируется как измерение с севера на юг от станции, чтобы\break построить вертикальные участки модели.

source: In the centerline object, you may add a special flags to the station, where continuation is possible.
ru_ru: В объекте centerline вы можете добавить специальные флаги к станции, где возможно продолжение.

source: In the file saved by XTherion, there'll only be whatever you type into the { Text editor} or see in the { Command preview}.
ru_ru: В файле, сохраненном XTherion'ом, будет только то, что вы введете в {Редакторе} или смотрите в {Просмотре команд}.

source: In the map mode it's possible to use a lot of predefined variables which are described in the previous chapter:
ru_ru: В режиме карты можно использовать множество предопределенных\break переменных, которые описаны в предыдущей главе:

source: In the map, also the question marks only are displayed by default.
ru_ru: На карте также отображаются только вопросительные знаки по умолчанию.

source: In the scrap (.th2 file), you can use |-text|, |-code| and |-explored| options to continuation symbol.
ru_ru: В скрапе (файл .th2) вы можете использовать опции |-text|, |-code| и |-explored| для символа продолжения.

source: In the { selection mode} you can select existing line or point objects and set their attributes in the corresponding menus, move them, or delete them (Ctrl-d or { Action button} in { File commands menu} after setting { Action} to { Delete}).
ru_ru: В { режиме выбора} вы можете выбрать существующие линейные или\break точечные объекты и установить их атрибуты в соответствующих меню,\break переместить их или удалить их (Ctrl-d или { Кнопка действия} в меню { Команды в файле} после установки { Действие} на { Удалить}).

source: In the { File commands} menu click on the { Action} submenu and select { Insert scrap}.
ru_ru: В меню { Команды в файле}\break выберите подменю { Действие} и выберите { Вставить скрап}.

source: In therion dataset, "cave" can be defined in several ways, depending on the level of cave survey.
ru_ru: В наборе данных, "пещера" может быть определена несколькими способами, в зависимости от уровня пещерной съемки.

source: In this case the map is coloured according to altitude, scraps or maps.
ru_ru: В этом случае карта окрашена в соответствии с высотой, скрапом или картой.

source: In this case you need also to define corresponding metapost symbol (see the chapter { New map symbols}).
ru_ru: В этом случае вам также необходимо определить соответствующий метапост символ (смотрите главу { Новые символы карты}).

source: In this case you should take care where you input your .th2 files containing scraps.
ru_ru: В этом случае вам следует позаботиться о том, где вы вводите ваши файлы .th2, содержащие скрапы.

source: In this case, if you do
ru_ru: В этом случае, если вы сделаете

source: In this case, it is much more natural to draw this shot as vertical (because it is a chimney).
ru_ru: В этом случае гораздо более естественно сделать этот замер вертикальным (потому что это труба).

source: In { use-out.th2} file you should refer to station names using:
ru_ru: В файле { use-out.th2} вы должны ссылаться на имена станций, используя:

source: Information files.
ru_ru: Информационный файл.

source: Initialization file for XTherion is actually a Tcl script evaluated when XTherion starts.
ru_ru: Файл инициализации для XTherion на самом деле является сценарием Tcl, обрабатываемыми при запуске XTherion'а.

source: Initialization files.
ru_ru: Файлы инициализации.
